package gb.seminarOne;

public class Main {
    public static void main(String[] args) {
        //Дан массив двоичных чисел, например [1,1,0,1,1,1],
        //вывести максимальное количество подряд идущих 1.

        //Дан массив nums = [3,2,2,3] и число val = 3.
        // Если в массиве есть числа, равные заданному, нужно перенести эти элементы в конец массива.
        // Таким образом, первые несколько (или все) элементов массива должны быть отличны от заданного,
        // а остальные - равны ему

    }
}
